## Production: terraform
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                      NAME                       |
|----------|-------------------------------------------------|
| add      | `aws_dynamodb_table.sre_bot_retry_records`      |
| update   | `aws_iam_policy.sre-bot_secrets_manager`        |
| recreate | `aws_backup_selection.sre_bot_backup_selection` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.sre-bot_secrets_manager will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sre-bot_secrets_manager" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sts:AssumeRole",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:iam::274536870005:role/sre_bot_role",
              + "arn:aws:iam::659087519042:role/sre_bot_role",
              + "arn:aws:iam::886481071419:role/sre_bot_role",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:283582579564:parameter/gcp_sre_service_account_key",
              + "arn:aws:ssm:ca-central-1:283582579564:parameter/sre-bot-config",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:ca-central-1:283582579564:table/aws_access_requests",
              + "arn:aws:dynamodb:ca-central-1:283582579564:table/incidents",
              + "arn:aws:dynamodb:ca-central-1:283582579564:table/sre_bot_audit_trail",
              + "arn:aws:dynamodb:ca-central-1:283582579564:table/sre_bot_data",
              + "arn:aws:dynamodb:ca-central-1:283582579564:table/sre_bot_idempotency",
              + "arn:aws:dynamodb:ca-central-1:283582579564:table/webhooks",
              + (known after apply),
            ]
        }
    }

  # aws_backup_selection.sre_bot_backup_selection must be replaced
-/+ resource "aws_backup_selection" "sre_bot_backup_selection" {
      ~ id            = "e862135c-ad34-4300-acfe-e6a994321d2c" -> (known after apply)
        name          = "sre-bot-dynamodb-backup-selection"
      ~ not_resources = [] -> (known after apply)
      ~ resources     = [
          - "arn:aws:dynamodb:ca-central-1:283582579564:table/aws_access_requests",
          - "arn:aws:dynamodb:ca-central-1:283582579564:table/incidents",
          - "arn:aws:dynamodb:ca-central-1:283582579564:table/sre_bot_data",
          - "arn:aws:dynamodb:ca-central-1:283582579564:table/webhooks",
        ] -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

      + condition {
          + string_equals {
              + key   = (known after apply)
              + value = (known after apply)
            }

          + string_like {
              + key   = (known after apply)
              + value = (known after apply)
            }

          + string_not_equals {
              + key   = (known after apply)
              + value = (known after apply)
            }

          + string_not_like {
              + key   = (known after apply)
              + value = (known after apply)
            }
        }
      - condition {
        }
    }

  # aws_dynamodb_table.sre_bot_retry_records will be created
  + resource "aws_dynamodb_table" "sre_bot_retry_records" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "record_id"
      + id               = (known after apply)
      + name             = "sre_bot_retry_records"
      + read_capacity    = 2
      + region           = "ca-central-1"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 2

      + attribute {
          + name = "next_retry_at"
          + type = "N"
        }
      + attribute {
          + name = "record_id"
          + type = "S"
        }
      + attribute {
          + name = "status"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "status"
          + name               = "status-next_retry_at-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "next_retry_at"
          + read_capacity      = 2
          + write_capacity     = 2

          + warm_throughput {
              + read_units_per_second  = (known after apply)
              + write_units_per_second = (known after apply)
            }
        }

      + global_table_witness {
          + region_name = (known after apply)
        }

      + point_in_time_recovery {
          + enabled                 = (known after apply)
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "ttl"
          + enabled        = true
        }

      + warm_throughput {
          + read_units_per_second  = (known after apply)
          + write_units_per_second = (known after apply)
        }
    }

  # aws_iam_policy.sre-bot_secrets_manager will be updated in-place
  ~ resource "aws_iam_policy" "sre-bot_secrets_manager" {
        id               = "arn:aws:iam::283582579564:policy/sre-botSecretsManagerKeyRetrieval"
        name             = "sre-botSecretsManagerKeyRetrieval"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::886481071419:role/sre_bot_role",
                          - "arn:aws:iam::659087519042:role/sre_bot_role",
                          - "arn:aws:iam::274536870005:role/sre_bot_role",
                        ]
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:283582579564:parameter/sre-bot-config",
                          - "arn:aws:ssm:ca-central-1:283582579564:parameter/gcp_sre_service_account_key",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ca-central-1:283582579564:table/webhooks",
                          - "arn:aws:dynamodb:ca-central-1:283582579564:table/sre_bot_idempotency",
                          - "arn:aws:dynamodb:ca-central-1:283582579564:table/sre_bot_data",
                          - "arn:aws:dynamodb:ca-central-1:283582579564:table/sre_bot_audit_trail",
                          - "arn:aws:dynamodb:ca-central-1:283582579564:table/incidents",
                          - "arn:aws:dynamodb:ca-central-1:283582579564:table/aws_access_requests",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.sre_bot_bucket.aws_s3_bucket.this,
  on .terraform/modules/sre_bot_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

versioning is deprecated. Use the aws_s3_bucket_versioning resource instead.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.sre_bot_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_backup_plan.sre_bot_backup_plan"]
WARN - plan.json - main - Missing Common Tags: ["aws_backup_vault.sre_bot_backup_vault"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sre-bot_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sre_bot_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sre_bot_waf_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sre_bot_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sre_bot_high_cpu"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sre_bot_high_memory"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sre_bot_warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.aws_access_requests_table"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.incidents_table"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.sre_bot_audit_trail"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.sre_bot_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.sre_bot_idempotency"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.sre_bot_retry_records"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.webhooks_table"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.sre-bot"]
WARN - plan.json - main - Missing...
```

</details>
